Idealized_Reef_CFD/Scenario_42/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          25;
        startFace       953947;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       953972;
    }
    atmosphere
    {
        type            patch;
        nFaces          2820;
        startFace       954012;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          956494;
        startFace       956832;
    }
    bedSurface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          21024;
        startFace       1913326;
    }
)

// ************************************************************************* //
